import random

곡류 = ['쌀밥', '백미', '잡곡밥', '보리', '찹쌀', '현미', '조', '수수', '기장', '국수', '건면', '라면사리', '당면', '떡', '묵', '팥', '감자', '고구마', '밤', '옥수수', '시리얼', '과자', '밀가루', '전분', '빵가루', '부침가루', '튀김가루', '믹스류', '호떡 믹스', '팬케이크 믹스']
고기생선달걀콩류 = ['육류', '쇠고기', '돼지고기', '닭고기', '오리고기', '달걀', '메추리알', '생선', '고등어', '꽁치', '명태', '동태', '조기', '갈치', '다랑어', '견과류', '땅콩', '아몬드', '호두', '잣', '해배라기씨', '호박씨', '참치 통조림', '다랑어 통조림', '두부', '바지락', '게', '굴', '오징어', '새우', '낙지', '햄', '소시지', '베이컨', '어묵', '게맛살', '어류젓갈', '말린 멸치', '말린 오징어', '말린 새우', '말린 뱅어포', '말린 명태', '대두', '완두콩', '강낭콩', '두유']
채소류 = ['해조류', '미역', '다시마', '김', '톳', '버섯', '느타리버섯', '표고버섯', '양송이버섯', '팽이버섯', '파', '양파', '당근', '풋고추', '무', '애호박', '오이', '콩나물', '시금치', '상추', '배추', '무청', '양배추', '깻잎', '피망', '부추', '토마토', '쑥갓', '붉은고추', '숙주나물', '고사리', '미나리', '배추김치', '깍두기', '단무지', '열무김치', '총각김치', '마늘', '생강', '우엉']
과일류 = ['수박', '참외', '딸기', '사과', '귤', '배', '바나나', '감', '포도', '복숭아', '키위', '파인애플', '과일음료', '건포도', '말린 대추']
우유유제품류 = ['우유', '액상요구르트', '호상요구르트', '치즈', '가루분유', '아이스크림']
유지당류 = ['식용유', '콩기름', '참기름', '들기름', '포도씨유', '버터', '마가린', '마요네즈', '깨', '흰깨', '들깨', '설탕', '꿀', '엿', '물엿', '초콜릿', '빙과류', '탄산음료', '커피믹스']

temp_list = 곡류 + 고기생선달걀콩류 + 채소류 + 과일류 + 우유유제품류 + 유지당류
random.shuffle(temp_list)

print('가정 과목 1차 수행평가 연습용으로 제작되었습니다.\n랜덤으로 나오는 32개 식품의 종류를 맞춰보세요!\n')
point = 0

for i in range(0, 32):
    # print(temp_list[i])
    print('==== ① 곡류 ==== ② 고기·생선·달걀·콩류 ==== ③ 채소류 ==== ④ 과일류 ==== ⑤ 우유·유제품류 ==== ⑥ 유지·당류 ====\n')
    answer = input('"' + temp_list[i] + '"' '은/는 어떤 식품군에 속할까요? 번호를 입력하고 엔터를 쳐주세요 : ')

    if answer == '1' and temp_list[i] in 곡류:
        print('⭕ 정답입니다! ⭕')
        point += 1
    elif answer == '2' and temp_list[i] in 고기생선달걀콩류:
        print('⭕ 정답입니다! ⭕')
        point += 1
    elif answer == '3' and temp_list[i] in 채소류:
        print('⭕ 정답입니다! ⭕')
        point += 1
    elif answer == '4' and temp_list[i] in 과일류:
        print('⭕ 정답입니다! ⭕')
        point += 1
    elif answer == '5' and temp_list[i] in 우유유제품류:
        print('⭕ 정답입니다! ⭕')
        point += 1
    elif answer == '6' and temp_list[i] in 유지당류:
        print('⭕ 정답입니다! ⭕')
        point += 1
    else:
        print('❌ 오답 또는 잘못된 입력입니다.. ❌')
    print('현재 점수는 ' + str(point) + '/' + str(i+1)+'점입니다.\n')

print('===================================================================================\n\n최종 점수는 ' + str(point) + '/32점입니다.')
if point == 32:
    print('🏆 완벽하네요! 수행평가에서도 좋은 성적이 나오길 바랍니다! 🏆')
elif 31 >= point >= 30:
    print('👍 잘했어요! 지금도 좋지만 더 완벽한 점수를 위해 달려가봅시다! 👍')
elif 29 >= point:
    print('🥲 수행평가 만점을 위해서는 노력이 더 필요할 것 같네요.. 열심히 공부합시다! 🥲')
print('\n===================================================================================')